Documents/РасходОбрезков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>РасходОбрезков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОбрезкиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходОбрезков/Forms/ФормаПодбора/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("АдресТаблицы", ПолучитьАдресТаблицы(ТаблицаВыбранных));
	
	ОповеститьОВыборе(Структура);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресТаблицы(Знач фТаблица)
	
	Возврат ПоместитьВоВременноеХранилище(фТаблица.Выгрузить());;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Подразделение = Параметры.Подразделение;
	УстановитьПараметрыЗапроса(Остатки, Подразделение);
	ТаблицаВыбранных.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьПараметрыЗапроса(ДинамическийСписок, фПодразделение)
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Подразделение", фПодразделение);
	
КонецФункции

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Остатки.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ДобавитьВыбранныйОбрезок(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьВыбранныйОбрезок(Строка)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура");
	Отбор.Вставить("Ширина");
	Отбор.Вставить("Высота");
	
	ЗаполнитьЗначенияСвойств(Отбор, Строка);
	
	НайденныеСтроки = ТаблицаВыбранных.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаРедактирования = ТаблицаВыбранных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРедактирования, Строка);
	Иначе
		СтрокаРедактирования = НайденныеСтроки[0];
	КонецЕсли;
	
	СтрокаРедактирования.Количество = СтрокаРедактирования.Количество + 1;
	
КонецФункции
